در CSS، عبارت "استفاده از `link`" به معنای اضافه کردن یک پیوند (link) به یک فایل CSS خارجی در صفحه HTML شما می‌باشد. این عمل به شما امکان می‌دهد تا استایل‌های تعریف شده در فایل CSS خارجی را در صفحه HTML خود استفاده کنید. بدین ترتیب، می‌توانید استایل‌های مشترک را برای چندین صفحه وب یا تمام صفحات وب خود به اشتراک بگذارید.

برای اضافه کردن یک فایل CSS خارجی به صفحه HTML، از عنصر `<link>` استفاده می‌کنید. این عنصر باید در بخش `<head>` اسناد HTML شما قرار گیرد. روش عمومی برای اضافه کردن فایل CSS به صفحه HTML به این صورت است:

```html
<!DOCTYPE html>
<html>
<head>
  <link rel="stylesheet" type="text/css" href="styles.css">
</head>
<body>
  <!-- محتویات صفحه HTML -->
</body>
</html>
```

در اینجا:

- `<link>`: از عنصر `link` برای ایجاد یک پیوند به فایل CSS استفاده می‌کنیم.
- `rel="stylesheet"`: این ویژگی نشان می‌دهد که این پیوند به یک فایل CSS مرتبط است.
- `type="text/css"`: این ویژگی نوع محتوای پیوند را تعیین می‌کند که در اینجا متن CSS است.
- `href="styles.css"`: این ویژگی مسیر (URL) به فایل CSS خارجی را مشخص می‌کند. شما باید مسیر فایل CSS خود را در اینجا قرار دهید.

با افزودن این پیوند (`link`) به صفحه HTML، محتوای فایل CSS خارجی (`styles.css` در مثال بالا) در صفحه HTML شما اعمال می‌شود و می‌توانید از کلاس‌ها و تعریف‌های استایل موجود در آن استفاده کنید تا ظاهر صفحه HTML خود را سفارشی کنید.
